app/views/posts/index.html.haml

  %p
    = post.comments.count
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]