app/views/posts/show.html.haml

#comment
  %h2.comment_count= pluralize(@post.comments.count, "Comment")
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]