app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.create(params[:comment].permit(:comment))
    @comment.user_id = current_user.id
    @comment.post_id = @post.id

    if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "comments" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-09-10 19:40:38.920626"], ["updated_at", "2015-09-10 19:40:38.920626"]]
UPDATE "comments" SET "user_id" = ?, "post_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["post_id", 6], ["updated_at", "2015-09-10 19:40:38.933102"], ["id", 1]]