app/controllers/posts_controller.rb

  def index
    @post = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def show
    @post = Post.find(params[:id])
    @comments = Comment.where(post_id: @post)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 6

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "link", "description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "link" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["link", "www.espinozabrand.com"], ["description", "He was DESTROYED by me!!! Muahahahaha"], ["updated_at", "2015-09-09 18:35:16.010225"], ["id", 3]]